-- phpMyAdmin SQL Dump
-- version 4.1.4
-- http://www.phpmyadmin.net
--
-- Host: localhost
-- Generation Time: 2014-08-11 11:40:54
-- 服务器版本： 5.6.16
-- PHP Version: 5.3.28

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;

--
-- Database: `shopdb`
--

-- --------------------------------------------------------

--
-- 表的结构 `lfywx_product`
-- 微信商品专用表格
--
CREATE TABLE `lfywx_product` (
  `id` bigint(10) NOT NULL AUTO_INCREMENT,
  `productCode` varchar(50) NOT NULL COMMENT '产品编码，界面显示',
  `category_code` varchar(50) DEFAULT NULL COMMENT '产品所属类别编码',
  `productName` varchar(100) DEFAULT NULL COMMENT '产品名称',
  `productDesc` text COMMENT '产品描述',
  `pic` varchar(50) DEFAULT NULL COMMENT '产品图片路径',
  `price` int(11) DEFAULT NULL COMMENT '产品价格',
  `cheapPrice` int(11) DEFAULT NULL COMMENT '打折价格',
  `stockNumber` int(11) DEFAULT NULL COMMENT '库存数量',
  `unit` int(11) DEFAULT NULL COMMENT '单位 0无 1份 2普通装 3标准杯 4盒 5其他',
  `otherUnit` varchar(255) DEFAULT NULL COMMENT '在unit 为 5 时 这边提供填写',
  `create_date` datetime DEFAULT NULL COMMENT '创建时间',
  `isNew` varchar(255) DEFAULT NULL COMMENT '是否新品 0否 1是',
  `status` varchar(255) DEFAULT NULL COMMENT '0 表示删除，1 表示正常',
  `update_date` datetime DEFAULT NULL COMMENT '产品更新时间，每次都是最新时间',
  `is_recommend` varchar(10) DEFAULT '0' COMMENT '是否推荐 1是 0否',
  `package` varchar(200) DEFAULT '' COMMENT '包装',
  `taste` varchar(200) DEFAULT NULL COMMENT '口味',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `lfywx_product`
--

INSERT INTO `lfywx_product` (`id`, `productCode`, `category_code`, `productName`, `productDesc`, `pic`, `price`, `cheapPrice`, `stockNumber`, `unit`, `otherUnit`, `create_date`, `isNew`, `status`, `update_date`, `is_recommend`, `package`, `taste`) VALUES
(1, '13974777092814', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '微辣鸭脖充氮装360g（长深）', 'F:特征    不辣、微辣、重辣、孜然、麻辣 、椒盐六种口味 A:优点    辣口不辣心有啃头，高蛋白低脂肪 B:益处    降血脂、美容养颜！', 'product_0.jpg', 3400, 3400, 5656, 4, '', '2014-04-14 20:15:09', '0', '1', '2014-04-14 20:15:09', '0', '充氮包装(长深)', '微辣'),
(2, '13974777436875', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '微辣鸭脖充氮装235g（大六边）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 2400, 2400, 5678, 4, '', '2014-04-14 20:15:43', '0', '1', '2014-04-14 20:15:43', '1', '充氮包装(大六边)', '微辣'),
(3, '13974777838911', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '不辣鸭脖充氮装360g（长深）', 'F:特征     不辣  微辣 重辣    三种口味 A:优点     营养价值和熊掌差不多，皮厚筋多 B:益处     女士吃了可养颜美容，也是绝佳的减肥食品', 'product_0.jpg', 3400, 3400, 567, 4, '', '2014-04-14 20:16:23', '0', '1', '2014-04-14 20:16:23', '1', '充氮包装(长深)', '不辣'),
(4, '13974778184495', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '不辣鸭脖充氮装235g（大六边）', 'F:特征     不辣  微辣  重辣 三种口味 A:优点     肌肉多，肉质紧实 B:益处     有小骨髓，有美容养颜之功效', 'product_0.jpg', 2400, 2400, 56, 4, '', '2014-04-14 20:16:58', '0', '1', '2014-04-14 20:16:58', '0', '充氮包装(大六边)', '不辣'),
(5, '13974778694592', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '超辣鸭脖充氮装360g（长深）', 'F:特征     微辣 A:优点     口感柔糯、有韧劲 B:益处     吃鸭舌可以口齿变伶俐', 'product_0.jpg', 3400, 3400, 45, 4, '', '2014-04-14 20:17:49', '0', '1', '2014-04-14 20:17:49', '1', '充氮包装(长深)', '超辣'),
(7, '13974779327985', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '超辣鸭脖充氮装235g（大六边）', 'F:特征     不辣，微辣 A:优点     入味，选用大鸭头，髓多，含丰富的蛋白质及维生素 B:益处     吃头补脑有助于新陈代谢', 'product_0.jpg', 2400, 2400, 45, 4, '', '2014-04-14 20:18:52', '0', '1', '2014-04-14 20:18:52', '1', '充氮包装(大六边)', '超辣'),
(8, '13974779661493', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '孜然鸭脖充氮装250g（长深）', 'F:特征     不辣，微辣 A:优点     入味，选用大鸭头，髓多，含丰富的蛋白质及维生素 B:益处     吃头补脑有助于新陈代谢', 'product_0.jpg', 2500, 2500, 45, 4, '', '2014-04-14 20:19:26', '0', '1', '2014-04-14 20:19:26', '1', '充氮包装(长深)', '孜然'),
(9, '13974779661434', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '孜然鸭脖充氮装200g（大六边）', 'F:特征    不辣、微辣、重辣、孜然、麻辣 、椒盐六种口味 A:优点    辣口不辣心有啃头，高蛋白低脂肪 B:益处    降血脂、美容养颜！', 'product_0.jpg', 2100, 2100, 444, 4, NULL, '2014-07-22 21:32:18', '0', '1', '2014-07-22 21:32:25', '0', '充氮包装(大六边)', '孜然'),
(10, '13974779327944', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '麻辣鸭脖充氮装250g（长深）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 2500, 2500, 45, 4, '', '2014-07-22 21:37:04', '0', '1', '2014-07-22 21:37:10', '0', '充氮包装(长深)', '麻辣'),
(11, '13974779327966', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '麻辣鸭脖充氮装200g（大六边）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 2100, 2100, 2700, 4, NULL, '2014-08-03 09:24:08', '0', '1', '2014-08-03 09:24:14', '0', '充氮包装(大六边)', '麻辣'),
(12, '13974779327977', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '椒盐鸭脖充氮装360g（长深）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 3500, 3500, 2300, 4, NULL, '2014-08-03 09:25:18', '0', '1', '2014-08-03 09:25:03', '0', '充氮包装(长深)', '椒盐'),
(13, '13974779327988', '1243cdd3-5a80-4cdf-ba86-a681c981a174', '椒盐鸭脖充氮装235g（大六边）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 2400, 2400, 2300, 4, NULL, '2014-08-03 09:25:22', '0', '1', '2014-08-03 09:25:06', '0', '充氮包装(大六边)', '椒盐'),
(14, '13974779327222', '23842c97-7063-453e-a5c9-3b25670a7190', '微辣鸭锁骨充氮装240g（长深）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 2700, 2700, 33, 4, NULL, '2014-08-05 19:06:19', '0', '1', '2014-08-05 19:06:25', '0', '充氮包装(长深)', '微辣'),
(15, '13974779327111', '23842c97-7063-453e-a5c9-3b25670a7190', '微辣鸭锁骨充氮装145g（大六边）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 1800, 1800, 23, 4, NULL, '2014-08-05 19:08:58', '0', '1', '2014-08-05 19:09:04', '0', '充氮包装(大六边)', '微辣'),
(16, '13974779327112', '23842c97-7063-453e-a5c9-3b25670a7190', '不辣鸭锁骨充氮装240g（长深）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 2700, 2700, 22, 4, NULL, '2014-08-05 19:10:30', '0', '1', '2014-08-05 19:10:36', '0', '充氮包装(长深)', '不辣'),
(17, '13974779327113', '23842c97-7063-453e-a5c9-3b25670a7190', '不辣鸭锁骨充氮装145g（大六边）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 1800, 1800, 34, 4, NULL, '2014-08-05 19:11:47', '0', '1', '2014-08-05 19:11:52', '0', '充氮包装(大六边)', '不辣'),
(18, '13974779327114', '23842c97-7063-453e-a5c9-3b25670a7190', '超辣鸭锁骨充氮装240g（长深）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 2700, 2700, 450, 4, NULL, '2014-08-05 19:13:37', '0', '1', '2014-08-05 19:13:42', '0', '充氮包装(长深)', '超辣'),
(19, '13974779327115', '23842c97-7063-453e-a5c9-3b25670a7190', '超辣鸭锁骨充氮装240g（长深）', 'F:特征    不辣   微辣   超辣 三种口味 A:优点    销量冠军，有小脆骨，骨肉相连 B:益处    补充钙质', 'product_0.jpg', 1800, 1800, 45, 4, NULL, '2014-08-05 19:14:57', '0', '1', '2014-08-05 19:15:02', '0', '充氮包装(大六边)', '超辣'),
(20, '13974779327116', '340db273-f25f-4a75-92cb-789a3db44af8', '微辣鸭掌充氮装215g（长深）', 'F:特征     不辣  微辣 重辣    三种口味 A:优点     营养价值和熊掌差不多，皮厚筋多 B:益处     女士吃了可养颜美容，也是绝佳的减肥食品', 'product_0.jpg', 2700, 2700, 45, 4, NULL, '2014-08-05 19:16:38', '0', '1', '2014-08-05 19:16:43', '0', '充氮包装(长深)', '微辣'),
(21, '13974779327117', '340db273-f25f-4a75-92cb-789a3db44af8', '微辣鸭掌充氮装165g（大六边）', 'F:特征     不辣  微辣 重辣    三种口味 A:优点     营养价值和熊掌差不多，皮厚筋多 B:益处     女士吃了可养颜美容，也是绝佳的减肥食品', 'product_0.jpg', 2200, 2200, 45, 4, NULL, '2014-08-05 19:18:17', '0', '1', '2014-08-05 19:18:22', '0', '充氮包装(大六边)', '微辣'),
(22, '13974779327118', '340db273-f25f-4a75-92cb-789a3db44af8', '不辣鸭掌充氮装215g（长深）', 'F:特征     不辣  微辣 重辣    三种口味 A:优点     营养价值和熊掌差不多，皮厚筋多 B:益处     女士吃了可养颜美容，也是绝佳的减肥食品', 'product_0.jpg', 2700, 2700, 45, 4, NULL, '2014-08-05 19:19:23', '0', '1', '2014-08-05 19:19:29', '0', '充氮包装(长深)', '不辣'),
(23, '13974779327119', '340db273-f25f-4a75-92cb-789a3db44af8', '不辣鸭掌充氮装165g（大六边）', 'F:特征     不辣  微辣 重辣    三种口味 A:优点     营养价值和熊掌差不多，皮厚筋多 B:益处     女士吃了可养颜美容，也是绝佳的减肥食品', 'product_0.jpg', 2200, 2200, 45, 4, NULL, '2014-08-05 19:20:32', '0', '1', '2014-08-05 19:20:38', '0', '充氮包装(大六边)', '不辣'),
(24, '13974779327200', '340db273-f25f-4a75-92cb-789a3db44af8', '超辣鸭掌充氮装215g（长深）', 'F:特征     不辣  微辣 重辣    三种口味 A:优点     营养价值和熊掌差不多，皮厚筋多 B:益处     女士吃了可养颜美容，也是绝佳的减肥食品', 'product_0.jpg', 2700, 2700, 45, 4, NULL, '2014-08-05 19:21:40', '0', '1', '2014-08-05 19:21:45', '0', '充氮包装(长深)', '超辣'),
(25, '13974779327201', '340db273-f25f-4a75-92cb-789a3db44af8', '超辣鸭掌充氮装165g（大六边）', 'F:特征     不辣  微辣 重辣    三种口味 A:优点     营养价值和熊掌差不多，皮厚筋多 B:益处     女士吃了可养颜美容，也是绝佳的减肥食品', 'product_0.jpg', 2200, 2200, 45, 4, NULL, '2014-08-05 19:22:41', '0', '1', '2014-08-05 19:22:47', '0', '充氮包装(大六边)', '超辣'),
(26, '13974779327202', '45d0415f-22bb-4204-bcad-4ed8c064f679', '微辣鸭翅充氮装250g（长深）', 'F:特征     不辣  微辣  重辣 三种口味 A:优点     肌肉多，肉质紧实 B:益处     有小骨髓，有美容养颜之功效', 'product_0.jpg', 2300, 2300, 45, 4, NULL, '2014-08-05 19:25:05', '0', '1', '2014-08-05 19:25:10', '0', '充氮包装(长深)', '微辣'),
(27, '13974779327203', '45d0415f-22bb-4204-bcad-4ed8c064f679', '微辣鸭翅充氮装195g（大六边）', 'F:特征     不辣  微辣  重辣 三种口味 A:优点     肌肉多，肉质紧实 B:益处     有小骨髓，有美容养颜之功效', 'product_0.jpg', 1900, 1900, 45, 4, NULL, '2014-08-05 19:26:18', '0', '1', '2014-08-05 19:26:23', '0', '充氮包装(大六边)', '微辣'),
(28, '13974779327204', '45d0415f-22bb-4204-bcad-4ed8c064f679', '不辣鸭翅充氮装250g（长深）', 'F:特征     不辣  微辣  重辣 三种口味 A:优点     肌肉多，肉质紧实 B:益处     有小骨髓，有美容养颜之功效', 'product_0.jpg', 2300, 2300, 45, 4, NULL, '2014-08-05 19:27:37', '0', '1', '2014-08-05 19:27:45', '0', '充氮包装(长深)', '不辣'),
(29, '13974779327205', '45d0415f-22bb-4204-bcad-4ed8c064f679', '不辣鸭翅充氮装195g（大六边）', 'F:特征     不辣  微辣  重辣 三种口味 A:优点     肌肉多，肉质紧实 B:益处     有小骨髓，有美容养颜之功效', 'product_0.jpg', 1900, 1900, 45, 4, NULL, '2014-08-05 19:29:03', '0', '1', '2014-08-05 19:29:09', '0', '充氮包装(大六边)', '不辣'),
(30, '13974779327206', '45d0415f-22bb-4204-bcad-4ed8c064f679', '超辣鸭翅充氮装250g（长深）', 'F:特征     不辣  微辣  重辣 三种口味 A:优点     肌肉多，肉质紧实 B:益处     有小骨髓，有美容养颜之功效', 'product_0.jpg', 2300, 2300, 45, 4, NULL, '2014-08-05 19:30:06', '0', '1', '2014-08-05 19:30:12', '0', '充氮包装(长深)', '超辣'),
(31, '13974779327207', '45d0415f-22bb-4204-bcad-4ed8c064f679', '超辣鸭翅充氮装195g（大六边）', 'F:特征     不辣  微辣  重辣 三种口味 A:优点     肌肉多，肉质紧实 B:益处     有小骨髓，有美容养颜之功效', 'product_0.jpg', 1900, 1900, 45, 4, NULL, '2014-08-05 19:31:09', '0', '1', '2014-08-05 19:31:14', '0', '充氮包装(大六边)', '超辣'),
(32, '13974779327208', '56fc52c0-3d8c-4963-ad5b-f4bf36ee50e2', '微辣鸭舌充氮装135g（长深）', 'F:特征     微辣 A:优点     口感柔糯、有韧劲 B:益处     吃鸭舌可以口齿变伶俐', 'product_0.jpg', 4100, 4100, 45, 4, NULL, '2014-08-05 19:33:00', '0', '1', '2014-08-05 19:33:05', '0', '充氮包装(长深)', '微辣'),
(33, '13974779327209', '56fc52c0-3d8c-4963-ad5b-f4bf36ee50e2', '微辣鸭舌充氮装115g（大六边）', 'F:特征     微辣 A:优点     口感柔糯、有韧劲 B:益处     吃鸭舌可以口齿变伶俐', 'product_0.jpg', 3500, 3500, 45, 4, NULL, '2014-08-05 19:34:36', '0', '1', '2014-08-05 19:34:41', '0', '充氮包装(大六边)', '微辣'),
(34, '13974779327210', '6746b025-dec8-46bb-a8f4-c8c1e46af2fa', '佛手充氮装245g（长深）', 'F:特征     微辣，香糯可口 A:优点     肉质有弹性、富含胶原蛋白 B:益处     可美容养颜、是护肤佳品', 'product_0.jpg', 2600, 2600, 45, 4, NULL, '2014-08-05 19:37:51', '0', '1', '2014-08-05 19:37:56', '0', '充氮包装(长深)', '不辣'),
(35, '13974779327211', '6746b025-dec8-46bb-a8f4-c8c1e46af2fa', '佛手充氮装200g（大六边）', 'F:特征     微辣，香糯可口 A:优点     肉质有弹性、富含胶原蛋白 B:益处     可美容养颜、是护肤佳品', 'product_0.jpg', 2100, 2100, 45, 4, NULL, '2014-08-05 19:40:11', '0', '1', '2014-08-05 19:40:16', '0', '充氮包装(大六边)', '不辣'),
(36, '13974779327212', '783c4997-624c-409e-9e2d-d267d99b630a', '微辣鸭头充氮装3个（长深）', 'F:特征     不辣，微辣 A:优点     入味，选用大鸭头，髓多，含丰富的蛋白质及维生素 B:益处     吃头补脑有助于新陈代谢', 'product_0.jpg', 2300, 2300, 45, 45, NULL, '2014-08-05 19:42:44', '0', '1', '2014-08-05 19:42:49', '0', '充氮包装(长深)', '微辣'),
(37, '13974779327213', '783c4997-624c-409e-9e2d-d267d99b630a', '微辣鸭头充氮装2个（大六边）', 'F:特征     不辣，微辣 A:优点     入味，选用大鸭头，髓多，含丰富的蛋白质及维生素 B:益处     吃头补脑有助于新陈代谢', 'product_0.jpg', 1800, 1800, 45, 4, NULL, '2014-08-05 19:44:10', '0', '1', '2014-08-05 19:44:15', '0', '充氮包装(大六边)', '微辣'),
(38, '13974779327214', '783c4997-624c-409e-9e2d-d267d99b630a', '不辣鸭头充氮装3个（长深）', 'F:特征     不辣，微辣 A:优点     入味，选用大鸭头，髓多，含丰富的蛋白质及维生素 B:益处     吃头补脑有助于新陈代谢', 'product_0.jpg', 2300, 2300, 45, 4, NULL, '2014-08-05 19:46:06', '0', '1', '2014-08-05 19:46:11', '0', '充氮包装(长深)', '不辣'),
(39, '13974779327215', '783c4997-624c-409e-9e2d-d267d99b630a', '不辣鸭头充氮装2个（大六边）', 'F:特征     不辣，微辣 A:优点     入味，选用大鸭头，髓多，含丰富的蛋白质及维生素 B:益处     吃头补脑有助于新陈代谢', 'product_0.jpg', 1800, 1800, 45, 4, NULL, '2014-08-05 19:47:41', '0', '1', '2014-08-05 19:47:47', '0', '充氮包装(大六边)', '不辣');

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
